# LibraryName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Asset..::..LibraryName Property
Asset Class See Also
---
Library name
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string LibraryName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LibraryName As String
	Get
```

Visual C++
---
```text
public:
property String^ LibraryName {
	String^ get ();
}
```

# See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace